<template>
  <main class="manager-cont main-layout">
    <h1 class="title">{{ title }}</h1>

    <div class="manager-wrapper">
      <div v-for="quote in quotes" :key="quote.id" class="manager-card">
        <img class="manager-img" :src="quote.image" :alt="quote.authorName" />
        <h6 class="author-name">-{{ quote.authorName }}-</h6>
        <div class="quote-container">
          <svg class="quote-svg-end" xmlns="http://www.w3.org/2000/svg" data-name="Layer 1" viewBox="0 0 128 128">
            <path
              d="M98.788 10.466a27.26 27.26 0 0 0-21.712 5.357 27.695 27.695 0 0 0 .12 44.405 27.276 27.276 0 0 0 25.509 4.324 1.33 1.33 0 0 1 1.25.186 1.364 1.364 0 0 1 .542 1.177c-1.249 27.64-26.037 38.446-30.994 40.332a3.658 3.658 0 0 0-2.323 3.937s.632 4.641.633 4.647a3.725 3.725 0 0 0 4.987 2.916c56.567-22.964 52.526-64.727 49.94-76.98-2.64-12.504-12.513-27.32-27.952-30.301zm4.49 18.086a2.002 2.002 0 0 1-2.815-.298c-4.287-5.303-11.658-2.548-11.733-2.518a2 2 0 1 1-1.437-3.734c.413-.159 10.184-3.805 16.283 3.737a2 2 0 0 1-.299 2.813zm-70.49-18.086a27.26 27.26 0 0 0-21.712 5.357 27.695 27.695 0 0 0 .12 44.405 27.276 27.276 0 0 0 25.509 4.324 1.33 1.33 0 0 1 1.25.186 1.364 1.364 0 0 1 .542 1.177c-1.249 27.64-26.037 38.446-30.994 40.332a3.658 3.658 0 0 0-2.323 3.937s.632 4.641.633 4.647a3.725 3.725 0 0 0 4.987 2.916c56.567-22.964 52.526-64.727 49.94-76.98-2.64-12.504-12.513-27.32-27.952-30.301zm4.49 18.086a2.054 2.054 0 0 1-2.815-.299c-4.287-5.302-11.658-2.547-11.733-2.518a2 2 0 1 1-1.437-3.733c.413-.159 10.184-3.805 16.283 3.737a2 2 0 0 1-.299 2.813z"
              fill="#ffa216"
              class="color000000 svgShape"
            ></path>
          </svg>
          <p class="quote">{{ quote.text }}</p>
          <svg class="quote-svg-start" xmlns="http://www.w3.org/2000/svg" data-name="Layer 1" viewBox="0 0 128 128">
            <path
              d="M98.788 10.466a27.26 27.26 0 0 0-21.712 5.357 27.695 27.695 0 0 0 .12 44.405 27.276 27.276 0 0 0 25.509 4.324 1.33 1.33 0 0 1 1.25.186 1.364 1.364 0 0 1 .542 1.177c-1.249 27.64-26.037 38.446-30.994 40.332a3.658 3.658 0 0 0-2.323 3.937s.632 4.641.633 4.647a3.725 3.725 0 0 0 4.987 2.916c56.567-22.964 52.526-64.727 49.94-76.98-2.64-12.504-12.513-27.32-27.952-30.301zm4.49 18.086a2.002 2.002 0 0 1-2.815-.298c-4.287-5.303-11.658-2.548-11.733-2.518a2 2 0 1 1-1.437-3.734c.413-.159 10.184-3.805 16.283 3.737a2 2 0 0 1-.299 2.813zm-70.49-18.086a27.26 27.26 0 0 0-21.712 5.357 27.695 27.695 0 0 0 .12 44.405 27.276 27.276 0 0 0 25.509 4.324 1.33 1.33 0 0 1 1.25.186 1.364 1.364 0 0 1 .542 1.177c-1.249 27.64-26.037 38.446-30.994 40.332a3.658 3.658 0 0 0-2.323 3.937s.632 4.641.633 4.647a3.725 3.725 0 0 0 4.987 2.916c56.567-22.964 52.526-64.727 49.94-76.98-2.64-12.504-12.513-27.32-27.952-30.301zm4.49 18.086a2.054 2.054 0 0 1-2.815-.299c-4.287-5.302-11.658-2.547-11.733-2.518a2 2 0 1 1-1.437-3.733c.413-.159 10.184-3.805 16.283 3.737a2 2 0 0 1-.299 2.813z"
              fill="#ffa216"
              class="color000000 svgShape"
            ></path>
          </svg>
        </div>
      </div>
    </div>
  </main>
</template>
<script>
import { gsap } from 'gsap';
import { ScrollTrigger } from 'gsap/ScrollTrigger';
import eitan from '../../styles/imgs/eitan-prf.jpeg'
import yaakov from '../../styles/imgs/yakov-prf.jpeg'
import einstain from '../../styles/imgs/Einstein-prf.jpg';


export default {
  components: {},
  data: () => {
    return {
      title: 'הצוות שלנו עזר למעל 100 תלמידים להגיע ליעדים שלהם',
      quotes: [
        {
          id: 0,
          image: eitan,
          text: 'הפסימי מתלונן על הרוח, האופטימי מצפה שהיא תשתנה, החכם מכוון את המפרש בהתאם. כשאנחנו כבר לא יכולים יותר לשנות את המצב, אנחנו מתחילים את האתגר של לשנות את עצמינו',
          authorName: 'איתן אנגלרד',
        },
        {
          id: 1,
          image: yaakov, 
          text: 'ספינה הכי בטוחה כשהיא עוגנת בנמל, אך לא לשם כך נועדו ספינות. אתם יכולים לשפוט בקלות אופי של אדם, דרך האופן שבו הוא מתייחס למי שלא יכול לעשות למענו דבר',
          authorName: 'יעקב גלרנטר',
        },
        
      ],
    }
  },
  mounted() {
    gsap.registerPlugin(ScrollTrigger)
    const animation = gsap.from('.manager-card', {
      x: -100,
      opacity: 0,
      stagger: 0.5,
      duration: 0.2,
      ease: 'power2.inOut',
      paused: true,
    })
    ScrollTrigger.create({
      onEnter: () => animation.play(),
    })
  },

  methods: {},
  computed: {},
}
</script>
